output/sysbench/sdc1thread20
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      2634.22
    writes/s:                     1756.31
    fsyncs/s:                     1756.31

Throughput:
    read, MiB/s:                  41.16
    written, MiB/s:               27.44

General statistics:
    total time:                          60.0173s
    total number of events:              263523

Latency (ms):
         min:                                  0.01
         avg:                                  4.55
         max:                                 36.18
         95th percentile:                     16.41
         sum:                            1199185.48

Threads fairness:
    events (avg/stddev):           13176.1500/77.39
    execution time (avg/stddev):   59.9593/0.00

WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      2630.88
    writes/s:                     1754.16
    fsyncs/s:                     1754.16

Throughput:
    read, MiB/s:                  41.11
    written, MiB/s:               27.41

General statistics:
    total time:                          60.0057s
    total number of events:              263143

Latency (ms):
         min:                                  0.01
         avg:                                  4.56
         max:                                 36.78
         95th percentile:                     17.01
         sum:                            1198996.11

Threads fairness:
    events (avg/stddev):           13157.1500/82.10
    execution time (avg/stddev):   59.9498/0.00

WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      2620.55
    writes/s:                     1747.20
    fsyncs/s:                     1747.20

Throughput:
    read, MiB/s:                  40.95
    written, MiB/s:               27.30

General statistics:
    total time:                          60.0098s
    total number of events:              262123

Latency (ms):
         min:                                  0.01
         avg:                                  4.57
         max:                                 36.26
         95th percentile:                     16.71
         sum:                            1198963.31

Threads fairness:
    events (avg/stddev):           13106.1500/70.99
    execution time (avg/stddev):   59.9482/0.00