output/sysbench/sdd1thread40
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      6811.97
    writes/s:                     4541.55
    fsyncs/s:                     4541.55

Throughput:
    read, MiB/s:                  106.44
    written, MiB/s:               70.96

General statistics:
    total time:                          60.0048s
    total number of events:              681304

Latency (ms):
         min:                                  0.01
         avg:                                  3.51
         max:                                 31.57
         95th percentile:                      9.39
         sum:                            2393823.42

Threads fairness:
    events (avg/stddev):           17032.6000/75.21
    execution time (avg/stddev):   59.8456/0.00

WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      6799.19
    writes/s:                     4533.14
    fsyncs/s:                     4533.14

Throughput:
    read, MiB/s:                  106.24
    written, MiB/s:               70.83

General statistics:
    total time:                          60.0059s
    total number of events:              680046

Latency (ms):
         min:                                  0.01
         avg:                                  3.52
         max:                                 34.44
         95th percentile:                      9.39
         sum:                            2393569.87

Threads fairness:
    events (avg/stddev):           17001.1500/83.56
    execution time (avg/stddev):   59.8392/0.00

WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      6842.18
    writes/s:                     4561.77
    fsyncs/s:                     4561.77

Throughput:
    read, MiB/s:                  106.91
    written, MiB/s:               71.28

General statistics:
    total time:                          60.0090s
    total number of events:              684379

Latency (ms):
         min:                                  0.01
         avg:                                  3.50
         max:                                 39.28
         95th percentile:                      9.39
         sum:                            2394002.12

Threads fairness:
    events (avg/stddev):           17109.4750/68.92
    execution time (avg/stddev):   59.8501/0.00